## Plan Result (1112: sbox_aria - Terraform Plan Apply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 27 to add, 21 to change, 45 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.rbac_account[&#34;00-xcutting&#34;]
  * azurerm_role_assignment.rbac_account[&#34;01-xcutting&#34;]
  * azurerm_role_assignment.rbac_account[&#34;02-xcutting&#34;]
  * azurerm_role_assignment.rbac_owner[&#34;00-xcutting&#34;]
  * azurerm_role_assignment.rbac_owner[&#34;01-xcutting&#34;]
  * azurerm_role_assignment.rbac_owner[&#34;02-xcutting&#34;]
  * azurerm_role_assignment.rbac_queue[&#34;00-xcutting&#34;]
  * azurerm_role_assignment.rbac_queue[&#34;01-xcutting&#34;]
  * azurerm_role_assignment.rbac_queue[&#34;02-xcutting&#34;]
  * azurerm_role_assignment.rbac_table[&#34;00-xcutting&#34;]
  * azurerm_role_assignment.rbac_table[&#34;01-xcutting&#34;]
  * azurerm_role_assignment.rbac_table[&#34;02-xcutting&#34;]
  * azurerm_role_assignment.rbac_write[&#34;00-xcutting&#34;]
  * azurerm_role_assignment.rbac_write[&#34;01-xcutting&#34;]
  * azurerm_role_assignment.rbac_write[&#34;02-xcutting&#34;]
  * azurerm_storage_account.xcutting[&#34;00&#34;]
  * azurerm_storage_account.xcutting[&#34;01&#34;]
  * azurerm_storage_account.xcutting[&#34;02&#34;]
  * azurerm_storage_container.xcutting[&#34;00-db-ack-checkpoint&#34;]
  * azurerm_storage_container.xcutting[&#34;00-db-rsp-checkpoint&#34;]
  * azurerm_storage_container.xcutting[&#34;01-db-ack-checkpoint&#34;]
  * azurerm_storage_container.xcutting[&#34;01-db-rsp-checkpoint&#34;]
  * azurerm_storage_container.xcutting[&#34;02-db-ack-checkpoint&#34;]
  * azurerm_storage_container.xcutting[&#34;02-db-rsp-checkpoint&#34;]
  * local_file.config[&#34;00&#34;]
  * local_file.config[&#34;01&#34;]
  * local_file.config[&#34;02&#34;]
* Update
  * azurerm_linux_function_app.example[&#34;00-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-td&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-td&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-td&#34;]
* Delete
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-aplfpa&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-aplfta&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-apluta&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-bails&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-joh&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-sbails&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;00-af-td&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;01-af-aplfpa&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;01-af-aplfta&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;01-af-apluta&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;01-af-bails&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;01-af-joh&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;01-af-sbails&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;01-af-td&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;02-af-aplfpa&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;02-af-aplfta&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;02-af-apluta&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;02-af-bails&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;02-af-joh&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;02-af-sbails&#34;]
  * azurerm_key_vault_access_policy.example-principal[&#34;02-af-td&#34;]
  * azurerm_role_assignment.rbac_account[&#34;00-zcutting&#34;]
  * azurerm_role_assignment.rbac_account[&#34;01-zcutting&#34;]
  * azurerm_role_assignment.rbac_account[&#34;02-zcutting&#34;]
  * azurerm_role_assignment.rbac_owner[&#34;00-zcutting&#34;]
  * azurerm_role_assignment.rbac_owner[&#34;01-zcutting&#34;]
  * azurerm_role_assignment.rbac_owner[&#34;02-zcutting&#34;]
  * azurerm_role_assignment.rbac_queue[&#34;00-zcutting&#34;]
  * azurerm_role_assignment.rbac_queue[&#34;01-zcutting&#34;]
  * azurerm_role_assignment.rbac_queue[&#34;02-zcutting&#34;]
  * azurerm_role_assignment.rbac_table[&#34;00-zcutting&#34;]
  * azurerm_role_assignment.rbac_table[&#34;01-zcutting&#34;]
  * azurerm_role_assignment.rbac_table[&#34;02-zcutting&#34;]
  * azurerm_role_assignment.rbac_write[&#34;00-zcutting&#34;]
  * azurerm_role_assignment.rbac_write[&#34;01-zcutting&#34;]
  * azurerm_role_assignment.rbac_write[&#34;02-zcutting&#34;]
  * azurerm_storage_account.zcutting[&#34;00&#34;]
  * azurerm_storage_account.zcutting[&#34;01&#34;]
  * azurerm_storage_account.zcutting[&#34;02&#34;]
  * azurerm_storage_container.zcutting[&#34;00-db-ack-checkpoint&#34;]
  * azurerm_storage_container.zcutting[&#34;00-db-rsp-checkpoint&#34;]
  * azurerm_storage_container.zcutting[&#34;01-db-ack-checkpoint&#34;]
  * azurerm_storage_container.zcutting[&#34;01-db-rsp-checkpoint&#34;]
  * azurerm_storage_container.zcutting[&#34;02-db-ack-checkpoint&#34;]
  * azurerm_storage_container.zcutting[&#34;02-db-rsp-checkpoint&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_storage_account_sas.xcutting["00"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_sas" "xcutting" {
      + connection_string = (sensitive value)
      + expiry            = "2027-12-31T23:59:59Z"
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = "2024-01-01T00:00:00Z"

      + permissions {
          + add     = true
          + create  = true
          + delete  = true
          + filter  = false
          + list    = true
          + process = true
          + read    = true
          + tag     = true
          + update  = true
          + write   = true
        }

      + resource_types {
          + container = true
          + object    = true
          + service   = true
        }

      + services {
          + blob  = true
          + file  = true
          + queue = true
          + table = true
        }
    }

  # data.azurerm_storage_account_sas.xcutting["01"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_sas" "xcutting" {
      + connection_string = (sensitive value)
      + expiry            = "2027-12-31T23:59:59Z"
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = "2024-01-01T00:00:00Z"

      + permissions {
          + add     = true
          + create  = true
          + delete  = true
          + filter  = false
          + list    = true
          + process = true
          + read    = true
          + tag     = true
          + update  = true
          + write   = true
        }

      + resource_types {
          + container = true
          + object    = true
          + service   = true
        }

      + services {
          + blob  = true
          + file  = true
          + queue = true
          + table = true
        }
    }

  # data.azurerm_storage_account_sas.xcutting["02"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_sas" "xcutting" {
      + connection_string = (sensitive value)
      + expiry            = "2027-12-31T23:59:59Z"
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = "2024-01-01T00:00:00Z"

      + permissions {
          + add     = true
          + create  = true
          + delete  = true
          + filter  = false
          + list    = true
          + process = true
          + read    = true
          + tag     = true
          + update  = true
          + write   = true
        }

      + resource_types {
          + container = true
          + object    = true
          + service   = true
        }

      + services {
          + blob  = true
          + file  = true
          + queue = true
          + table = true
        }
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-aplfpa"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/objectId/6be63684-e1ec-470b-8a16-ab1337c0252c" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox" -> null
      - object_id               = "6be63684-e1ec-470b-8a16-ab1337c0252c" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-aplfta"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/objectId/4fbddc51-9662-4343-bdd0-570fc950e0ed" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox" -> null
      - object_id               = "4fbddc51-9662-4343-bdd0-570fc950e0ed" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-apluta"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/objectId/1789119f-88ac-4ce6-8716-7b4e684d182e" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox" -> null
      - object_id               = "1789119f-88ac-4ce6-8716-7b4e684d182e" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-bails"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/objectId/72e6893c-9d79-465b-b173-0e0eea285b3d" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox" -> null
      - object_id               = "72e6893c-9d79-465b-b173-0e0eea285b3d" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-joh"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/objectId/7cdc9deb-7bc6-41d4-ae37-eb284db52480" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox" -> null
      - object_id               = "7cdc9deb-7bc6-41d4-ae37-eb284db52480" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-sbails"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/objectId/a49b42dd-164a-433a-b2e7-72acaffe4e7b" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox" -> null
      - object_id               = "a49b42dd-164a-433a-b2e7-72acaffe4e7b" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["00-af-td"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox/objectId/318b507a-008b-4225-88b3-166c226afe88" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox" -> null
      - object_id               = "318b507a-008b-4225-88b3-166c226afe88" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["01-af-aplfpa"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.KeyVault/vaults/ingest01-meta002-sbox/objectId/d8689332-e3e9-41c6-a279-21fdd669f357" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.KeyVault/vaults/ingest01-meta002-sbox" -> null
      - object_id               = "d8689332-e3e9-41c6-a279-21fdd669f357" -> null
      - secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          - "List",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Set",
        ] -> null
      - storage_permissions     = [
          - "Backup",
          - "Delete",
          - "DeleteSAS",
          - "Get",
          - "GetSAS",
          - "List",
          - "ListSAS",
          - "Purge",
          - "Recover",
          - "RegenerateKey",
          - "Restore",
          - "Set",
          - "SetSAS",
          - "Update",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_access_policy.example-principal["01-af-aplfta"] will be destroyed
  # (because azurerm_key_vault_access_policy.example-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "example-principal" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.KeyVault/vaults/ingest01-meta002-sbox/objectId/d73f24a5-5e34-4152-8c3c-8c8221876dc2" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Encrypt",
          - "Decrypt",
          - "Backup",
          - "Create",
          - "Delete",
          - "Import",
          - "Purge",
          - "Recover",
          - "Restore",
          - "Sign",
          - "UnwrapKey",
          - "Update",
          - "Verify",
          - "WrapKey",
          - "Release",
          - "Rotate",
        ] -> null
      - key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.KeyVault/vaults/ingest01-meta002-sbox" -> null
      - object_id               = "d73f24a5-5e34-4152-8c3c-8c8221876dc2" -> null
      - secret_permissions  

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

                            = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "environment"  = "sandbox"
        } -> null
        # (56 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # azurerm_storage_account.zcutting["02"] will be destroyed
  # (because azurerm_storage_account.zcutting is not in configuration)
  - resource "azurerm_storage_account" "zcutting" {
      - access_tier                        = "Hot" -> null
      - account_kind                       = "StorageV2" -> null
      - account_replication_type           = "LRS" -> null
      - account_tier                       = "Standard" -> null
      - allow_nested_items_to_be_public    = true -> null
      - cross_tenant_replication_enabled   = false -> null
      - default_to_oauth_authentication    = false -> null
      - dns_endpoint_type                  = "Standard" -> null
      - https_traffic_only_enabled         = true -> null
      - id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest02zcuttingsbox" -> null
      - infrastructure_encryption_enabled  = false -> null
      - is_hns_enabled                     = false -> null
      - large_file_share_enabled           = false -> null
      - local_user_enabled                 = true -> null
      - location                           = "uksouth" -> null
      - min_tls_version                    = "TLS1_2" -> null
      - name                               = "ingest02zcuttingsbox" -> null
      - nfsv3_enabled                      = false -> null
      - primary_access_key                 = (sensitive value) -> null
      - primary_blob_connection_string     = (sensitive value) -> null
      - primary_blob_endpoint              = "https://ingest02zcuttingsbox.blob.core.windows.net/" -> null
      - primary_blob_host                  = "ingest02zcuttingsbox.blob.core.windows.net" -> null
      - primary_connection_string          = (sensitive value) -> null
      - primary_dfs_endpoint               = "https://ingest02zcuttingsbox.dfs.core.windows.net/" -> null
      - primary_dfs_host                   = "ingest02zcuttingsbox.dfs.core.windows.net" -> null
      - primary_file_endpoint              = "https://ingest02zcuttingsbox.file.core.windows.net/" -> null
      - primary_file_host                  = "ingest02zcuttingsbox.file.core.windows.net" -> null
      - primary_location                   = "uksouth" -> null
      - primary_queue_endpoint             = "https://ingest02zcuttingsbox.queue.core.windows.net/" -> null
      - primary_queue_host                 = "ingest02zcuttingsbox.queue.core.windows.net" -> null
      - primary_table_endpoint             = "https://ingest02zcuttingsbox.table.core.windows.net/" -> null
      - primary_table_host                 = "ingest02zcuttingsbox.table.core.windows.net" -> null
      - primary_web_endpoint               = "https://ingest02zcuttingsbox.z33.web.core.windows.net/" -> null
      - primary_web_host                   = "ingest02zcuttingsbox.z33.web.core.windows.net" -> null
      - public_network_access_enabled      = true -> null
      - queue_encryption_key_type          = "Service" -> null
      - resource_group_name                = "ingest02-main-sbox" -> null
      - secondary_access_key               = (sensitive value) -> null
      - secondary_connection_string        = (sensitive value) -> null
      - sftp_enabled                       = false -> null
      - shared_access_key_enabled          = true -> null
      - table_encryption_key_type          = "Service" -> null
      - tags                               = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "environment"  = "sandbox"
        } -> null
        # (56 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # azurerm_storage_container.xcutting["00-db-ack-checkpoint"] will be created
  + resource "azurerm_storage_container" "xcutting" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "db-ack-checkpoint"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "ingest00xcuttingsbox"
    }

  # azurerm_storage_container.xcutting["00-db-rsp-checkpoint"] will be created
  + resource "azurerm_storage_container" "xcutting" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "db-rsp-checkpoint"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "ingest00xcuttingsbox"
    }

  # azurerm_storage_container.xcutting["01-db-ack-checkpoint"] will be created
  + resource "azurerm_storage_container" "xcutting" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "db-ack-checkpoint"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "ingest01xcuttingsbox"
    }

  # azurerm_storage_container.xcutting["01-db-rsp-checkpoint"] will be created
  + resource "azurerm_storage_container" "xcutting" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "db-rsp-checkpoint"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "ingest01xcuttingsbox"
    }

  # azurerm_storage_container.xcutting["02-db-ack-checkpoint"] will be created
  + resource "azurerm_storage_container" "xcutting" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "db-ack-checkpoint"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "ingest02xcuttingsbox"
    }

  # azurerm_storage_container.xcutting["02-db-rsp-checkpoint"] will be created
  + resource "azurerm_storage_container" "xcutting" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "db-rsp-checkpoint"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "ingest02xcuttingsbox"
    }

  # azurerm_storage_container.zcutting["00-db-ack-checkpoint"] will be destroyed
  # (because azurerm_storage_container.zcutting is not in configuration)
  - resource "azurerm_storage_container" "zcutting" {
      - container_access_type             = "private" -> null
      - default_encryption_scope          = "$account-encryption-key" -> null
      - encryption_scope_override_enabled = true -> null
      - has_immutability_policy           = false -> null
      - has_legal_hold                    = false -> null
      - id                                = "https://ingest00zcuttingsbox.blob.core.windows.net/db-ack-checkpoint" -> null
      - metadata                          = {} -> null
      - name                              = "db-ack-checkpoint" -> null
      - resource_manager_id               = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00zcuttingsbox/blobServices/default/containers/db-ack-checkpoint" -> null
      - storage_account_name              = "ingest00zcuttingsbox" -> null
    }

  # azurerm_storage_container.zcutting["00-db-rsp-checkpoint"] will be destroyed
  # (because azurerm_storage_container.zcutting is not in configuration)
  - resource "azurerm_storage_container" "zcutting" {
      - container_access_type             = "private" -> null
      - default_encryption_scope          = "$account-encryption-key" -> null
      - encryption_scope_override_enabled = true -> null
      - has_immutability_policy           = false -> null
      - has_legal_hold                    = false -> null
      - id                                = "https://ingest00zcuttingsbox.blob.core.windows.net/db-rsp-checkpoint" -> null
      - metadata                          = {} -> null
      - name                              = "db-rsp-checkpoint" -> null
      - resource_manager_id               = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00zcuttingsbox/blobServices/default/containers/db-rsp-checkpoint" -> null
      - storage_account_name              = "ingest00zcuttingsbox" -> null
    }

  # azurerm_storage_container.zcutting["01-db-ack-checkpoint"] will be destroyed
  # (because azurerm_storage_container.zcutting is not in configuration)
  - resource "azurerm_storage_container" "zcutting" {
      - container_access_type             = "private" -> null
      - default_encryption_scope          = "$account-encryption-key" -> null
      - encryption_scope_override_enabled = true -> null
      - has_immutability_policy           = false -> null
      - has_legal_hold                    = false -> null
      - id                                = "https://ingest01zcuttingsbox.blob.core.windows.net/db-ack-checkpoint" -> null
      - metadata                          = {} -> null
      - name                              = "db-ack-checkpoint" -> null
      - resource_manager_id               = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest01zcuttingsbox/blobServices/default/containers/db-ack-checkpoint" -> null
      - storage_account_name              = "ingest01zcuttingsbox" -> null
    }

  # azurerm_storage_container.zcutting["01-db-rsp-checkpoint"] will be destroyed
  # (because azurerm_storage_container.zcutting is not in configuration)
  - resource "azurerm_storage_container" "zcutting" {
      - container_access_type             = "private" -> null
      - default_encryption_scope          = "$account-encryption-key" -> null
      - encryption_scope_override_enabled = true -> null
      - has_immutability_policy           = false -> null
      - has_legal_hold                    = false -> null
      - id                                = "https://ingest01zcuttingsbox.blob.core.windows.net/db-rsp-checkpoint" -> null
      - metadata                          = {} -> null
      - name                              = "db-rsp-checkpoint" -> null
      - resource_manager_id               = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest01zcuttingsbox/blobServices/default/containers/db-rsp-checkpoint" -> null
      - storage_account_name              = "ingest01zcuttingsbox" -> null
    }

  # azurerm_storage_container.zcutting["02-db-ack-checkpoint"] will be destroyed
  # (because azurerm_storage_container.zcutting is not in configuration)
  - resource "azurerm_storage_container" "zcutting" {
      - container_access_type             = "private" -> null
      - default_encryption_scope          = "$account-encryption-key" -> null
      - encryption_scope_override_enabled = true -> null
      - has_immutability_policy           = false -> null
      - has_legal_hold                    = false -> null
      - id                                = "https://ingest02zcuttingsbox.blob.core.windows.net/db-ack-checkpoint" -> null
      - metadata                          = {} -> null
      - name                              = "db-ack-checkpoint" -> null
      - resource_manager_id               = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest02zcuttingsbox/blobServices/default/containers/db-ack-checkpoint" -> null
      - storage_account_name              = "ingest02zcuttingsbox" -> null
    }

  # azurerm_storage_container.zcutting["02-db-rsp-checkpoint"] will be destroyed
  # (because azurerm_storage_container.zcutting is not in configuration)
  - resource "azurerm_storage_container" "zcutting" {
      - container_access_type             = "private" -> null
      - default_encryption_scope          = "$account-encryption-key" -> null
      - encryption_scope_override_enabled = true -> null
      - has_immutability_policy           = false -> null
      - has_legal_hold                    = false -> null
      - id                                = "https://ingest02zcuttingsbox.blob.core.windows.net/db-rsp-checkpoint" -> null
      - metadata                          = {} -> null
      - name                              = "db-rsp-checkpoint" -> null
      - resource_manager_id               = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest02zcuttingsbox/blobServices/default/containers/db-rsp-checkpoint" -> null
      - storage_account_name              = "ingest02zcuttingsbox" -> null
    }

  # local_file.config["00"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "00"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_00.json"
      + id                   = (known after apply)
    }

  # local_file.config["01"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "01"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_01.json"
      + id                   = (known after apply)
    }

  # local_file.config["02"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "02"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_02.json"
      + id                   = (known after apply)
    }

Plan: 27 to add, 21 to change, 45 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":173,"Program":"tfcmt","SHA1":"","Target":"1112: sbox_aria - Terraform Plan Apply","Vars":{}} -->